<h2> Pandas DataFrames </h2>

In [97]:
import pandas as pd

In [98]:
# cria um dicionario com autores, precos e titulos

dictionary = {
    "Autores": ["Autor A", "Autor B", "Autor C", "Autor D", "Autor E"],
    "Titulos": ["Título 1", "Título 2", "Título 3", "Título 4", "Título 5"],
    "Precos": [29.90, 49.50, 35.00, 55.75, 42.80],
}

In [99]:
##DataFrame
# Permite trabalhar com dados em forma de tabelas

df = pd.DataFrame(dictionary)
df

   Autores   Titulos  Precos
0  Autor A  Título 1   29.90
1  Autor B  Título 2   49.50
2  Autor C  Título 3   35.00
3  Autor D  Título 4   55.75
4  Autor E  Título 5   42.80

In [100]:
# se eu quiser saber somente pelos autores (buscando por titulo)
df["Autores"]

0    Autor A
1    Autor B
2    Autor C
3    Autor D
4    Autor E
Name: Autores, dtype: object

In [101]:
df["Autores"][1]

'Autor B'

In [102]:
# O dataFrame é basicamente uma series
# Então podemos fazer filtros de dados como médias, e outras coisas

df["Precos"].mean()

42.589999999999996

In [103]:
# Filtragem baseada nas masks
mascara = df["Autores"] == "Autor A"
print(mascara)

df[mascara]

0     True
1    False
2    False
3    False
4    False
Name: Autores, dtype: bool

   Autores   Titulos  Precos
0  Autor A  Título 1    29.9

In [104]:
df["Autores"] == "Autor C"

0    False
1    False
2     True
3    False
4    False
Name: Autores, dtype: bool

In [105]:
# Adicionar um dado novo ignorando o indice, para adicionar ao final da lista
# Adicionando uma nova linha ao DataFrame
df.loc[len(df)] = ["Autor B", "My jomba", 23.4]

df

   Autores   Titulos  Precos
0  Autor A  Título 1   29.90
1  Autor B  Título 2   49.50
2  Autor C  Título 3   35.00
3  Autor D  Título 4   55.75
4  Autor E  Título 5   42.80
5  Autor B  My jomba   23.40

In [106]:
# alterar valor de um df
# primeiro criamos uma mascara
mascara_alteracao = df["Titulos"] == "My jomba"
# agora que temos os items localizados
df[mascara_alteracao]

   Autores   Titulos  Precos
5  Autor B  My jomba    23.4

In [107]:
# Vamos pegar somente o valor da coluna sem o resto das colunas
df.loc[mascara_alteracao, "Titulos"]

5    My jomba
Name: Titulos, dtype: object

In [110]:
# alterar o primeiro valor localizado
df.loc[mascara_alteracao, "Titulos"] = "Teste"
# vamos verificar como ficou
df

   Autores   Titulos  Precos
0  Autor A  Título 1   29.90
1  Autor B  Título 2   49.50
2  Autor C  Título 3   35.00
3  Autor D  Título 4   55.75
4  Autor E  Título 5   42.80
5  Autor B     Teste   23.40

<h3>Execicio de fixação</h3>

In [125]:
dfExercicio = pd.DataFrame(
    {"Nome": ["João Maria", "Alceu Vasco", "Algum nome"], "Idade": [10, 20, 30]}
)
dfExercicio

          Nome  Idade
0   João Maria     10
1  Alceu Vasco     20
2   Algum nome     30

In [126]:
# Adicione um novo objeto ai
dfExercicio.loc[len(df)] = ["Maria Joaquina", 10]
dfExercicio

             Nome  Idade
0      João Maria     10
1     Alceu Vasco     20
2      Algum nome     30
6  Maria Joaquina     10

In [127]:
# altere o nome de Alceu e a idade de João
mask_alter_name = dfExercicio["Nome"] == "João Maria"
print(mask_alter_name)
dfExercicio[mask_alter_name]

0     True
1    False
2    False
6    False
Name: Nome, dtype: bool

         Nome  Idade
0  João Maria     10

In [137]:
dfExercicio.loc[mask_alter_name, 'Nome'] = "João Alterado"

dfExercicio

             Nome  Idade
0   João Alterado     10
1     Alceu Vasco     20
2      Algum nome     30
6  Maria Joaquina     10

In [140]:
dfExercicio['Nome'] == "Maria Joaquina"

<>:1: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
<>:1: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
C:\Users\pablo\AppData\Local\Temp\ipykernel_2056\3948733973.py:1: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
  dfExercicio['Nome'] == "Maria Joaquina"["idade"]

TypeError: string indices must be integers, not 'str'